In [1]:
import pandas as pd
df1=pd.read_excel("C:\\Users\\29265\\Desktop\\data.xlsx",sheetname='Sheet3')
df1

    str   sales  units    txns
0  str1  _20_\n      1  4000.0
1  str2     30#      1  2000.0
2  str3     NaN      1  1000.0
3  str4     #20      1  2000.0
4  str5     NaN      1  2000.0
5  str7     #40      1     NaN

In [2]:
%timeit df1.sales.str.replace('#','')

1000 loops, best of 3: 273 Âµs per loop

In [3]:
df1

    str   sales  units    txns
0  str1  _20_\n      1  4000.0
1  str2     30#      1  2000.0
2  str3     NaN      1  1000.0
3  str4     #20      1  2000.0
4  str5     NaN      1  2000.0
5  str7     #40      1     NaN

In [8]:
df1.str = [x.strip('r') for x in df1.str]

In [10]:
df1

   str   sales  units    txns
0  tr1  _20_\n      1  4000.0
1  tr2     30#      1  2000.0
2  tr3     NaN      1  1000.0
3  tr4     #20      1  2000.0
4  tr5     NaN      1  2000.0
5  tr7     #40      1     NaN

In [12]:
import numpy as np
np.fromstring(df1.str.values.astype('|S7').tobytes().replace(b'r',b''), dtype='|S6')

array([b't1', b't2', b't3', b't4', b't5', b't7'],
      dtype='|S6')

In [13]:
df1

   str   sales  units    txns
0  tr1  _20_\n      1  4000.0
1  tr2     30#      1  2000.0
2  tr3     NaN      1  1000.0
3  tr4     #20      1  2000.0
4  tr5     NaN      1  2000.0
5  tr7     #40      1     NaN